In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier #importing decision tree classifier
from sklearn.model_selection import train_test_split #importing train_test_split function
from sklearn.metrics import accuracy_score#importing metrics for accuracy calculation (confusion matrix)
from sklearn.ensemble import BaggingClassifier#bagging combines the results of multipls models to get a generalized result. 
from sklearn.ensemble import AdaBoostClassifier #boosting method attempts to correct the errors of previous models.
from sklearn.metrics import classification_report, confusion_matrix
from sklearn.preprocessing import LabelEncoder

In [2]:
data=pd.read_csv(r'C:\Users\Mahesh\Desktop\data science\Asssignment\Decision Tree\Fraud_check.csv')

In [3]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [4]:
data.dtypes

Undergrad          object
Marital.Status     object
Taxable.Income      int64
City.Population     int64
Work.Experience     int64
Urban              object
dtype: object

In [5]:
data = data.rename({'Marital.Status': 'Marital_Status'}, axis=1)

In [6]:
data = data.rename({'Taxable.Income': 'Taxable_Income'}, axis=1)

In [7]:
data = data.rename({'City.Population': 'City_Population'}, axis=1)

In [8]:
data = data.rename({'Work.Experience': 'Work_Experience'}, axis=1)

In [9]:
data.tail()

,Undergrad,Marital_Status,Taxable_Income,City_Population,Work_Experience,Urban
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [10]:
labelencoder = LabelEncoder()

In [11]:
data.iloc[:, -1] = labelencoder.fit_transform(data.iloc[:,-1])

In [12]:
data.iloc[:, -5] = labelencoder.fit_transform(data.iloc[:,-5])

In [13]:
data.iloc[:, -6] = labelencoder.fit_transform(data.iloc[:,-6])

In [14]:
data.head()

,Undergrad,Marital_Status,Taxable_Income,City_Population,Work_Experience,Urban
0,0,2,68833,50047,10,1
1,1,0,33700,134075,18,1
2,0,1,36925,160205,30,1
3,1,2,50190,193264,15,1
4,0,1,81002,27533,28,0

In [15]:
data['Income'] = data.Taxable_Income.map(lambda x: 1 if x>=30000 else 0) #1=Good, 0=Risky

In [16]:
data.head()

,Undergrad,Marital_Status,Taxable_Income,City_Population,Work_Experience,Urban,Income
0,0,2,68833,50047,10,1,1
1,1,0,33700,134075,18,1,1
2,0,1,36925,160205,30,1,1
3,1,2,50190,193264,15,1,1
4,0,1,81002,27533,28,0,1

In [17]:
feature_cols=['Undergrad','Marital_Status','City_Population','Work_Experience','Urban']

In [18]:
x = data[feature_cols]
y = data.Income

In [19]:
print(x)

     Undergrad  Marital_Status  City_Population  Work_Experience  Urban
0            0               2            50047               10      1
1            1               0           134075               18      1
2            0               1           160205               30      1
3            1               2           193264               15      1
4            0               1            27533               28      0
..         ...             ...              ...              ...    ...
595          1               0            39492                7      1
596          1               0            55369                2      1
597          0               0           154058                0      1
598          1               1           180083               17      0
599          0               0           158137               16      0

[600 rows x 5 columns]

In [20]:
print(y)

0      1
1      1
2      1
3      1
4      1
      ..
595    1
596    1
597    1
598    1
599    1
Name: Income, Length: 600, dtype: int64

In [21]:
x_train,x_test,y_train,y_test= train_test_split(x,y, test_size=0.2,random_state=25)

In [22]:
dcmodel =  BaggingClassifier(DecisionTreeClassifier(max_depth = 9), random_state=25) #decision tree classifier object

In [23]:
dcmodel =  AdaBoostClassifier(DecisionTreeClassifier(max_depth = 9), random_state=25) #decision tree classifier object

In [24]:
dcmodel = dcmodel.fit(x_train,y_train) #train decision tree

In [25]:
y_predict = dcmodel.predict(x_test)

In [26]:
print("Accuracy : ", accuracy_score(y_test,y_predict)*100 )

Accuracy :  80.83333333333333

In [27]:
print(confusion_matrix(y_test,y_predict))

[[ 3 15]
 [ 8 94]]

In [28]:
print(classification_report(y_test,y_predict))

              precision    recall  f1-score   support

           0       0.27      0.17      0.21        18
           1       0.86      0.92      0.89       102

    accuracy                           0.81       120
   macro avg       0.57      0.54      0.55       120
weighted avg       0.77      0.81      0.79       120

### Building Decision Tree Classifier using Entropy Criteria

In [29]:
model = DecisionTreeClassifier(criterion = 'entropy',max_depth=3)
model.fit(x_train,y_train)

DecisionTreeClassifier(criterion='entropy', max_depth=3)

In [30]:
model.get_n_leaves()

7

In [31]:
preds = model.predict(x_test) # predicting on test data set 
pd.Series(preds).value_counts()

1    117
0      3
dtype: int64

In [32]:
preds

array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 1, 1], dtype=int64)

In [33]:
pd.crosstab(y_test,preds)

col_0   0    1
Income
0       1   17
1       2  100

In [34]:
np.mean(preds==y_test)

0.8416666666666667

### Building Decision Tree Classifier (CART) using Gini Criteria

In [35]:
# Decision Tree Regression
from sklearn.tree import DecisionTreeRegressor

In [36]:
model = DecisionTreeRegressor()
model.fit(x_train, y_train)

DecisionTreeRegressor()

In [37]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=1)

In [38]:
#Find the accuracy
model.score(x_test,y_test)

0.7180379746835441